# **`Lab3 - Data Engineering & EDA with Python, SQL, and Pandas`**

##### **Name** - Manu Mathew
##### **CourseID** - PROG8245
##### **Course** - Machine Learning Programming
##### **Student ID** - 8990691

---

**Install required packages**

In [26]:
%pip install psycopg2-binary pandas faker sqlalchemy scikit-learn

Requirement already satisfied: psycopg2-binary in ./.venv/lib/python3.13/site-packages (2.9.10)
Requirement already satisfied: pandas in ./.venv/lib/python3.13/site-packages (2.2.3)
Requirement already satisfied: faker in ./.venv/lib/python3.13/site-packages (37.3.0)
Requirement already satisfied: sqlalchemy in ./.venv/lib/python3.13/site-packages (2.0.41)
Requirement already satisfied: scikit-learn in ./.venv/lib/python3.13/site-packages (1.6.1)
Requirement already satisfied: numpy>=1.26.0 in ./.venv/lib/python3.13/site-packages (from pandas) (2.2.6)
Requirement already satisfied: python-dateutil>=2.8.2 in ./.venv/lib/python3.13/site-packages (from pandas) (2.9.0.post0)
Requirement already satisfied: pytz>=2020.1 in ./.venv/lib/python3.13/site-packages (from pandas) (2025.2)
Requirement already satisfied: tzdata>=2022.7 in ./.venv/lib/python3.13/site-packages (from pandas) (2025.2)
Requirement already satisfied: typing-extensions>=4.6.0 in ./.venv/lib/python3.13/site-packages (from sqlalchemy) (4.14.0)
Requirement already satisfied: scipy>=1.6.0 in ./.venv/lib/python3.13/site-packages (from scikit-learn) (1.15.3)
Requirement already satisfied: joblib>=1.2.0 in ./.venv/lib/python3.13/site-packages (from scikit-learn) (1.5.1)
Requirement already satisfied: threadpoolctl>=3.1.0 in ./.venv/lib/python3.13/site-packages (from scikit-learn) (3.6.0)
Requirement already satisfied: six>=1.5 in ./.venv/lib/python3.13/site-packages (from python-dateutil>=2.8.2->pandas) (1.17.0)
Note: you may need to restart the kernel to use updated packages.

`1 -- `
- Create a free SQL Database
- Create a table named employees with the following columns:
    - employee_id (integer, primary key)
    - name (string)
    - position (string, IT-related job titles)
    - start_date (date, between 2015 and 2024)
    - salary (integer, $60,000â€“$200,000)`

I have set up a Postgres database and also I have created the SQL table using the below SQL query

```SQL
CREATE TABLE employees (
  employee_id SERIAL PRIMARY KEY,
  name VARCHAR(50),
  position VARCHAR(50),
  start_date DATE,
  salary INTEGER
);

**Adding the imports**

In [27]:
import random
from faker import Faker
from datetime import date
import pandas as pd
# import psycopg2
from sqlalchemy import create_engine
from sklearn.preprocessing import MinMaxScaler

`2 --`
- Generate & Populate Data
    - Generate at least 50 synthetic records using Python and the Faker library.
    - Insert the data into your cloud database.

In [28]:
# Initializes faker object from the Faker library
fake = Faker()
# Position list that can be assigned randomly to employees
positions = ['Software Engineer', 'Data Analyst', 'DevOps Engineer', 'ML Engineer', 'QA Engineer','Backend Developer', 'Frontend Developer', 'Cloud Architect', 'SysAdmin', 'Data Scientist']
# Running a loop for 100 iterations
for i in range(100):
    # Replace single quote with double quotes
    name = fake.name().replace("'", "''")
    # Select random position for the employee
    position = random.choice(positions)
    # Select any date in the year between 2015 and 2024
    start_date = fake.date_between(start_date=date(2015,1,1), end_date=date(2024,6,1))
    # Select an integer between 60000 and 200000
    salary = random.randint(60000, 200000)
    # print 100 SQL insert queries
    print(f"INSERT INTO employees (name, position, start_date, salary) VALUES('{name}', '{position}', '{start_date}', {salary});")

INSERT INTO employees (name, position, start_date, salary) VALUES('Dennis Ramos', 'Frontend Developer', '2019-04-07', 165782);
INSERT INTO employees (name, position, start_date, salary) VALUES('Jordan Cruz', 'SysAdmin', '2020-09-09', 174274);
INSERT INTO employees (name, position, start_date, salary) VALUES('Dustin Ray PhD', 'QA Engineer', '2018-08-10', 169549);
INSERT INTO employees (name, position, start_date, salary) VALUES('Jessica Gross', 'QA Engineer', '2016-09-24', 177066);
INSERT INTO employees (name, position, start_date, salary) VALUES('Linda Potts', 'SysAdmin', '2019-06-07', 151760);
INSERT INTO employees (name, position, start_date, salary) VALUES('Elizabeth Quinn', 'Frontend Developer', '2018-05-17', 167983);
INSERT INTO employees (name, position, start_date, salary) VALUES('Yesenia Hale', 'Data Analyst', '2018-03-28', 174993);
INSERT INTO employees (name, position, start_date, salary) VALUES('Amy Higgins', 'Data Scientist', '2016-01-31', 193258);
INSERT INTO employees (name, position, start_date, salary) VALUES('Jessica Williams', 'Data Analyst', '2021-06-25', 184746);
INSERT INTO employees (name, position, start_date, salary) VALUES('Logan Gutierrez', 'SysAdmin', '2018-03-11', 139926);
INSERT INTO employees (name, position, start_date, salary) VALUES('Brittany Bailey', 'SysAdmin', '2017-04-21', 114389);
INSERT INTO employees (name, position, start_date, salary) VALUES('Stephanie Lee', 'Software Engineer', '2016-01-09', 183948);
INSERT INTO employees (name, position, start_date, salary) VALUES('Jeffrey Young', 'Cloud Architect', '2016-04-07', 199937);
INSERT INTO employees (name, position, start_date, salary) VALUES('Jennifer Harvey', 'Frontend Developer', '2021-01-16', 168090);
INSERT INTO employees (name, position, start_date, salary) VALUES('Nicholas Sellers', 'Data Analyst', '2020-11-07', 172552);
INSERT INTO employees (name, position, start_date, salary) VALUES('Lori Garcia', 'Frontend Developer', '2018-06-21', 146299);
INSERT INTO employees (name, position, start_date, salary) VALUES('Mrs. Paula Fernandez', 'ML Engineer', '2022-12-02', 180389);
INSERT INTO employees (name, position, start_date, salary) VALUES('Amanda Lee', 'ML Engineer', '2016-06-23', 176131);
INSERT INTO employees (name, position, start_date, salary) VALUES('Christopher Morales', 'QA Engineer', '2020-09-08', 86848);
INSERT INTO employees (name, position, start_date, salary) VALUES('Annette Murray', 'QA Engineer', '2018-07-12', 114455);
INSERT INTO employees (name, position, start_date, salary) VALUES('Alexis Fox', 'ML Engineer', '2015-02-19', 122230);
INSERT INTO employees (name, position, start_date, salary) VALUES('Patricia Martinez', 'Backend Developer', '2017-02-02', 93263);
INSERT INTO employees (name, position, start_date, salary) VALUES('Karen Adkins', 'Cloud Architect', '2017-02-11', 167789);
INSERT INTO employees (name, position, start_date, salary) VALUES('Madison French', 'Backend Developer', '2024-01-21', 186450);
INSERT INTO employees (name, position, start_date, salary) VALUES('Rickey Whitney', 'Cloud Architect', '2020-02-18', 136179);
INSERT INTO employees (name, position, start_date, salary) VALUES('Karen Graham', 'ML Engineer', '2017-05-18', 138649);
INSERT INTO employees (name, position, start_date, salary) VALUES('Renee Mckee', 'SysAdmin', '2021-07-29', 183872);
INSERT INTO employees (name, position, start_date, salary) VALUES('Matthew Rogers', 'ML Engineer', '2019-06-15', 122225);
INSERT INTO employees (name, position, start_date, salary) VALUES('Elizabeth Hebert', 'Data Analyst', '2019-10-24', 103227);
INSERT INTO employees (name, position, start_date, salary) VALUES('Danielle Carroll', 'DevOps Engineer', '2018-12-25', 179086);
INSERT INTO employees (name, position, start_date, salary) VALUES('Rebecca Grant', 'Frontend Developer', '2018-04-24', 74302);
INSERT INTO employees (name, position, start_date, salary) VALUES('John Ferguson', 'DevOps Engineer', '2015-08-31', 73449);
INSERT INTO employees (name, position, start_date, salary) VALUES('Janet Smith', 'DevOps Engineer', '2018-06-17', 82537);
INSERT INTO employees (name, position, start_date, salary) VALUES('Katherine Newton', 'Cloud Architect', '2023-06-03', 199564);
INSERT INTO employees (name, position, start_date, salary) VALUES('Dr. Eric White', 'Data Analyst', '2017-10-24', 122012);
INSERT INTO employees (name, position, start_date, salary) VALUES('Melanie Stewart', 'Backend Developer', '2016-08-26', 104392);
INSERT INTO employees (name, position, start_date, salary) VALUES('Jeffery Wilson', 'Frontend Developer', '2021-03-15', 172814);
INSERT INTO employees (name, position, start_date, salary) VALUES('Christine Walker', 'Data Analyst', '2017-04-11', 63202);
INSERT INTO employees (name, position, start_date, salary) VALUES('Eric Moore', 'SysAdmin', '2017-12-27', 133812);
INSERT INTO employees (name, position, start_date, salary) VALUES('Emily Alvarez', 'QA Engineer', '2019-12-06', 123731);
INSERT INTO employees (name, position, start_date, salary) VALUES('Morgan Townsend', 'Cloud Architect', '2019-07-12', 101518);
INSERT INTO employees (name, position, start_date, salary) VALUES('Cameron Long', 'Cloud Architect', '2020-06-22', 149198);
INSERT INTO employees (name, position, start_date, salary) VALUES('Jennifer Rogers', 'Cloud Architect', '2021-11-08', 102415);
INSERT INTO employees (name, position, start_date, salary) VALUES('Jennifer Dyer', 'ML Engineer', '2018-01-20', 155880);
INSERT INTO employees (name, position, start_date, salary) VALUES('Charles Stephenson', 'DevOps Engineer', '2018-03-29', 121326);
INSERT INTO employees (name, position, start_date, salary) VALUES('Rebecca Manning', 'ML Engineer', '2016-02-29', 133596);
INSERT INTO employees (name, position, start_date, salary) VALUES('George Thomas', 'Software Engineer', '2019-02-16', 158303);
INSERT INTO employees (name, position, start_date, salary) VALUES('Austin Suarez', 'Backend Developer', '2016-12-22', 87458);
INSERT INTO employees (name, position, start_date, salary) VALUES('Laura Salazar', 'Software Engineer', '2023-03-26', 134698);
INSERT INTO employees (name, position, start_date, salary) VALUES('David Wilson', 'DevOps Engineer', '2019-06-10', 83474);
INSERT INTO employees (name, position, start_date, salary) VALUES('Kenneth Woods', 'Data Scientist', '2019-09-15', 91761);
INSERT INTO employees (name, position, start_date, salary) VALUES('Bryan Rivers', 'Data Scientist', '2016-10-11', 184634);
INSERT INTO employees (name, position, start_date, salary) VALUES('Jesse Yang', 'SysAdmin', '2017-03-06', 130165);
INSERT INTO employees (name, position, start_date, salary) VALUES('Carmen Green', 'Data Analyst', '2018-02-25', 86026);
INSERT INTO employees (name, position, start_date, salary) VALUES('Kyle Owens', 'Cloud Architect', '2016-06-30', 107249);
INSERT INTO employees (name, position, start_date, salary) VALUES('Linda Rangel', 'Data Analyst', '2022-12-09', 92613);
INSERT INTO employees (name, position, start_date, salary) VALUES('Rebecca Sandoval', 'ML Engineer', '2020-08-17', 170325);
INSERT INTO employees (name, position, start_date, salary) VALUES('Mikayla Morgan', 'Frontend Developer', '2020-05-11', 183709);
INSERT INTO employees (name, position, start_date, salary) VALUES('Kelly Anderson', 'Data Scientist', '2015-11-18', 194332);
INSERT INTO employees (name, position, start_date, salary) VALUES('Francisco Moore', 'QA Engineer', '2019-01-20', 135271);
INSERT INTO employees (name, position, start_date, salary) VALUES('Sydney Morales', 'Data Analyst', '2019-03-31', 60018);
INSERT INTO employees (name, position, start_date, salary) VALUES('William Wilkinson', 'Software Engineer', '2022-07-16', 116879);
INSERT INTO employees (name, position, start_date, salary) VALUES('Stephen Nelson', 'Cloud Architect', '2022-05-11', 169009);
INSERT INTO employees (name, position, start_date, salary) VALUES('Gina Rice', 'QA Engineer', '2015-02-22', 113015);
INSERT INTO employees (name, position, start_date, salary) VALUES('Casey Bennett', 'QA Engineer', '2023-02-15', 133792);
INSERT INTO employees (name, position, start_date, salary) VALUES('Dawn Hooper', 'DevOps Engineer', '2018-06-09', 95008);
INSERT INTO employees (name, position, start_date, salary) VALUES('Danielle Peterson', 'Software Engineer', '2022-09-12', 153263);
INSERT INTO employees (name, position, start_date, salary) VALUES('Rachael Simmons', 'QA Engineer', '2019-08-27', 160610);
INSERT INTO employees (name, position, start_date, salary) VALUES('Paula Nguyen', 'Data Analyst', '2024-02-07', 123179);
INSERT INTO employees (name, position, start_date, salary) VALUES('Carla Ortiz', 'Data Scientist', '2023-11-15', 74544);
INSERT INTO employees (name, position, start_date, salary) VALUES('Jennifer Johnson', 'Cloud Architect', '2021-05-06', 66351);
INSERT INTO employees (name, position, start_date, salary) VALUES('Amanda Bradshaw', 'Data Scientist', '2019-05-26', 191620);
INSERT INTO employees (name, position, start_date, salary) VALUES('Nicole Smith', 'Software Engineer', '2017-02-27', 159655);
INSERT INTO employees (name, position, start_date, salary) VALUES('Laurie Gillespie', 'SysAdmin', '2015-08-23', 193056);
INSERT INTO employees (name, position, start_date, salary) VALUES('Cody Dawson', 'Data Scientist', '2020-05-23', 173050);
INSERT INTO employees (name, position, start_date, salary) VALUES('Melody Merritt', 'Data Scientist', '2015-10-19', 194968);
INSERT INTO employees (name, position, start_date, salary) VALUES('Ross Rosales', 'Software Engineer', '2016-11-12', 142022);
INSERT INTO employees (name, position, start_date, salary) VALUES('Nicholas Brooks', 'Backend Developer', '2023-04-01', 162437);
INSERT INTO employees (name, position, start_date, salary) VALUES('Kimberly Castillo', 'Cloud Architect', '2022-04-19', 120002);
INSERT INTO employees (name, position, start_date, salary) VALUES('Nicholas Phillips', 'Software Engineer', '2021-02-03', 83014);
INSERT INTO employees (name, position, start_date, salary) VALUES('Jeffrey Cline', 'DevOps Engineer', '2016-07-20', 180992);
INSERT INTO employees (name, position, start_date, salary) VALUES('Karina Koch', 'Cloud Architect', '2017-12-15', 81699);
INSERT INTO employees (name, position, start_date, salary) VALUES('Bonnie Morgan', 'SysAdmin', '2021-01-07', 190907);
INSERT INTO employees (name, position, start_date, salary) VALUES('Michelle Dean', 'SysAdmin', '2023-07-10', 146706);
INSERT INTO employees (name, position, start_date, salary) VALUES('Robert Morales', 'Data Analyst', '2024-05-31', 95757);
INSERT INTO employees (name, position, start_date, salary) VALUES('Taylor Francis', 'Software Engineer', '2020-05-06', 118698);
INSERT INTO employees (name, position, start_date, salary) VALUES('Joseph Francis', 'Cloud Architect', '2017-03-07', 167019);
INSERT INTO employees (name, position, start_date, salary) VALUES('Karen Woods', 'QA Engineer', '2015-05-09', 139570);
INSERT INTO employees (name, position, start_date, salary) VALUES('Michael Henderson', 'Frontend Developer', '2020-11-28', 76397);
INSERT INTO employees (name, position, start_date, salary) VALUES('Elizabeth Smith', 'ML Engineer', '2016-08-24', 72372);
INSERT INTO employees (name, position, start_date, salary) VALUES('Natalie Cannon', 'Cloud Architect', '2015-01-08', 137979);
INSERT INTO employees (name, position, start_date, salary) VALUES('Mary Vaughan', 'Frontend Developer', '2019-01-01', 168013);
INSERT INTO employees (name, position, start_date, salary) VALUES('Debbie Mcmahon', 'DevOps Engineer', '2017-05-23', 90941);
INSERT INTO employees (name, position, start_date, salary) VALUES('Cory Harrison', 'Data Scientist', '2023-10-29', 112902);
INSERT INTO employees (name, position, start_date, salary) VALUES('Linda Patterson', 'Backend Developer', '2018-05-04', 117430);
INSERT INTO employees (name, position, start_date, salary) VALUES('Ethan Warner', 'Data Scientist', '2023-08-31', 138181);
INSERT INTO employees (name, position, start_date, salary) VALUES('Michele Heath', 'Software Engineer', '2021-04-28', 77270);
INSERT INTO employees (name, position, start_date, salary) VALUES('Emily Mitchell', 'Data Scientist', '2023-08-04', 146324);
INSERT INTO employees (name, position, start_date, salary) VALUES('Steven Campbell', 'Software Engineer', '2016-08-24', 65789);
INSERT INTO employees (name, position, start_date, salary) VALUES('Keith Smith', 'ML Engineer', '2019-01-29', 128856);

`3--`
- Connect and Load Data
- Using Python, psycopg2, and Pandas, connect to your cloud database.
- Query the entire employee table and load the data into a Pandas DataFrame.
- Display the first few rows using df.head().

In [29]:
# Connection string
conn_str = "postgresql://neondb_owner:npg_Ppd3S2nUcWfx@ep-steep-rain-a8s0cnp2-pooler.eastus2.azure.neon.tech/neondb?sslmode=require"
# Create SQLAlchemy engine
engine = create_engine(conn_str)
# Query entire employee table and load the data into the dataframe
df = pd.read_sql_query("SELECT * FROM employees;", engine)
# Display the first few records , showing the first 50 records
print(df.head(50))
# Close the engine
engine.dispose()

    employee_id                   name            position  start_date  salary
0             1      Zachary Rogers MD            SysAdmin  2024-01-31  164268
1             2      Francis Castaneda        Data Analyst  2023-04-09   92677
2             3            Oscar Davis      Data Scientist  2019-02-12  114123
3             4            David Brown   Software Engineer  2021-05-11  183617
4             5         Corey Campbell            SysAdmin  2023-07-04   64790
5             6  Dr. Kyle Martinez DDS         ML Engineer  2017-01-11   86908
6             7        Kristin Russell         ML Engineer  2016-12-07   68990
7             8         Patricia Gates   Backend Developer  2018-04-02  140714
8             9          Kelly Carlson            SysAdmin  2019-12-18  107035
9            10        Samantha Hardin     DevOps Engineer  2016-11-04  198378
10           11           Brian Newman         ML Engineer  2019-09-07   94029
11           12      Mikayla Dickerson         ML Engineer  2020-06-20  171252
12           13          Robert Wilson   Backend Developer  2016-11-27   96765
13           14         Zachary Taylor            SysAdmin  2019-03-19  172969
14           15            Brooke Rice            SysAdmin  2015-06-06  114391
15           16          Ashley Arnold            SysAdmin  2021-02-24   85972
16           17            Amber Gould      Data Scientist  2015-01-22  142882
17           18       Christopher Diaz        Data Analyst  2016-06-05  187503
18           19        Travis Marshall   Software Engineer  2015-11-19  122830
19           20              Beth Hart     Cloud Architect  2017-05-28  156517
20           21        Brian Rodriguez     DevOps Engineer  2020-10-29  108627
21           22          Karen Nichols     Cloud Architect  2020-05-18  126015
22           23            Alan Garcia     DevOps Engineer  2020-09-04  124212
23           24           Ryan Winters        Data Analyst  2018-02-25  147986
24           25          Shelby Taylor      Data Scientist  2016-02-11  180404
25           26        Elizabeth Smith     Cloud Architect  2019-09-21   60200
26           27            Marvin Wood     DevOps Engineer  2016-05-05  184470
27           28            Sharon Hall            SysAdmin  2016-11-13  111090
28           29         Tracie Salazar     DevOps Engineer  2019-06-11  194233
29           30            Chris Smith         ML Engineer  2022-05-28  161000
30           31          Todd Anderson      Data Scientist  2020-10-01  104828
31           32           Brandi Casey   Backend Developer  2015-09-11  148238
32           33           Debra Davies  Frontend Developer  2015-04-19   83147
33           34    Samantha Oliver DDS      Data Scientist  2018-07-22   96135
34           35        Christina Floyd  Frontend Developer  2022-02-17  145760
35           36           Luke Griffin         ML Engineer  2019-11-27   88537
36           37           Sara Stewart        Data Analyst  2023-12-05   72123
37           38           Shirley Hart     Cloud Architect  2015-10-19  111158
38           39          Cynthia Reyes   Backend Developer  2019-11-27  102843
39           40           Adam Johnson        Data Analyst  2021-02-23   69521
40           41      Christina Gardner     DevOps Engineer  2022-03-25  172320
41           42           Anna Pittman  Frontend Developer  2023-12-04  198157
42           43             Juan Brown   Backend Developer  2015-06-21  151509
43           44           Brian Levine     Cloud Architect  2015-06-08  111293
44           45         Allison Miller            SysAdmin  2023-11-11  188380
45           46            Sherry Holt        Data Analyst  2018-09-01  169029
46           47          Larry Douglas        Data Analyst  2021-02-05  136119
47           48           Terry Harris     Cloud Architect  2023-03-11  190637
48           49             Seth Chang   Backend Developer  2018-08-18  107043
49           50           Deborah Ford  Frontend Developer  2020-10-04  130907

`3--`
**Explain each EDA step**

**Data Collection**

**`Database Setup and data collection`**
- Go to https://neon.tech/
- Sign up with your GitHub or Google account
- After logging in, click `Create a project`
- Set the project name.
- Choose any region and click `CreateProject`
- Once in the project dashboard page, click on the `connect` button on top right side.
- Copy the connection string
- Select the SQLEditor option , and then copy the SQL query below to create the employees table
- ```SQL
    CREATE TABLE employees (
    employee_id SERIAL PRIMARY KEY,
    name VARCHAR(50),
    position VARCHAR(50),
    start_date DATE,
    salary INTEGER
    );
- Generate 100 asynthetic records using Python and the Faker library. We generate 100 INSERT queries and copy the insert queries.
- Go to project dashboard page and then selected `SQLEditor` and then executed the 100 INSERT queries to insert the data into the cloud database.

**Data Cleaning**
- I checked for the missing values and I could find that there were no null or empty values present. This was checked using the command `df.info()`
- Also the data types for each columns names were correct as per the requirement using the command `df.info()`

In [30]:
# Column types and null counts
df.info()

# Check for the missing values
df.isnull().sum()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 200 entries, 0 to 199
Data columns (total 5 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   employee_id  200 non-null    int64
 1   name         200 non-null    object
 2   position     200 non-null    object
 3   start_date   200 non-null    object
 4   salary       200 non-null    int64
dtypes: int64(2), object(3)
memory usage: 7.9+ KB

employee_id    0
name           0
position       0
start_date     0
salary         0
dtype: int64

**Data Transformation**
- As part of data transformation , I have created a new column `years_of_service` by calculating the difference between the current date and the sart_date

In [31]:
df['years_of_service'] = date.today().year - pd.DatetimeIndex(df['start_date']).year
df.head()

,employee_id,name,position,start_date,salary,years_of_service
0,1,Zachary Rogers MD,SysAdmin,2024-01-31,164268,1
1,2,Francis Castaneda,Data Analyst,2023-04-09,92677,2
2,3,Oscar Davis,Data Scientist,2019-02-12,114123,6
3,4,David Brown,Software Engineer,2021-05-11,183617,4
4,5,Corey Campbell,SysAdmin,2023-07-04,64790,2

**Feature Engineering**
- As a part of the feature engineering, I have created **new columns** that will more effectively help in visualization. I have added new columns and they are
- **Normalized Salary** - Salary are usually in large numbers like $80,000 or $150,000, which can be hard to compare so I used a method called *Min-Max Scaling* to convert all salaries to a range between **0 and 1** and this makes it easier to make visualizations.
- **Seniority Level** -
  - "Junior" if they have worked less than 3 years
  - "Mid-Level" if they have worked between 3 and 6 years
  - "Senior" if they have worked more than 6 years

  `To implement the Seniority Level, I used the lamda function`.

In [32]:
# Normalize the salary column using Min-Max Scaling
minmax = MinMaxScaler()
df['normalized_salary'] = minmax.fit_transform(df[['salary']])

# Create a seniority level based on years of service
df['seniority'] = df['years_of_service'].apply(
    lambda x: 'Junior' if x < 3 else 'Mid-Level' if x < 7 else 'Senior'
)

# Show new features
df[['employee_id', 'name', 'position', 'normalized_salary', 'years_of_service', 'seniority']].head()

,employee_id,name,position,normalized_salary,years_of_service,seniority
0,1,Zachary Rogers MD,SysAdmin,0.753144,1,Junior
1,2,Francis Castaneda,Data Analyst,0.235037,2,Junior
2,3,Oscar Davis,Data Scientist,0.390243,6,Mid-Level
3,4,David Brown,Software Engineer,0.893174,4,Mid-Level
4,5,Corey Campbell,SysAdmin,0.033218,2,Junior